{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "FxIFBna4Y6AV"
   },
   "source": [
    "## Source: https://colab.research.google.com/drive/1KL2N-DrHmn1osEINduRJzq78jaJERFzr\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "id": "iPf2nMPpM7XW",
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "%%capture\n",
    "!pip install wikidataintegrator\n",
    "!pip install backoff\n",
    "!pip install RDF"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "qJsiVOcwMu99",
    "outputId": "0883d8ab-e581-4502-82e8-c1fa2332092a",
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Downloading Mondo ...\n",
      "\n",
      "Parsing Mondo in rdflib Graph\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Ncd9a88e120c64ada852987e5b0dabc58 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from wikidataintegrator import wdi_core, wdi_login\n",
    "import os\n",
    "from rdflib import Graph, URIRef\n",
    "import pandas as pd\n",
    "\n",
    "# This code is to Login to Wikibase. The pattern of api is the URL of the wikibase + /w/api.php\n",
    "# In this example that is https://diseases.semscape.org/w/api.php\n",
    "\n",
    "\n",
    "## The following section is to download the orginal Disease ontology\n",
    "print(\"\\nDownloading Mondo ...\")\n",
    "url = \"http://purl.obolibrary.org/obo/mondo.owl\"\n",
    "\n",
    "print(\"\\nParsing Mondo in rdflib Graph\")\n",
    "doGraph = Graph()\n",
    "doGraph.parse(url, format=\"xml\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "ename": "ModuleNotFoundError",
     "evalue": "No module named 'RDF'",
     "output_type": "error",
     "traceback": [
      "\u001B[0;31m---------------------------------------------------------------------------\u001B[0m",
      "\u001B[0;31mModuleNotFoundError\u001B[0m                       Traceback (most recent call last)",
      "\u001B[0;32m<ipython-input-3-b26c043adcf5>\u001B[0m in \u001B[0;36m<module>\u001B[0;34m\u001B[0m\n\u001B[0;32m----> 1\u001B[0;31m \u001B[0;32mimport\u001B[0m \u001B[0mRDF\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m      2\u001B[0m \u001B[0mparser\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mRDF\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mParser\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mname\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0;34m\"ntriples\"\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      3\u001B[0m \u001B[0mmodel\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mRDF\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mModel\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      4\u001B[0m \u001B[0mstream\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mparser\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mparse_into_model\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mmodel\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0murl\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m      5\u001B[0m \u001B[0;32mfor\u001B[0m \u001B[0mtriple\u001B[0m \u001B[0;32min\u001B[0m \u001B[0mmodel\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;31mModuleNotFoundError\u001B[0m: No module named 'RDF'"
     ]
    }
   ],
   "source": [
    "import RDF\n",
    "parser=RDF.Parser(name=\"ntriples\")\n",
    "model=RDF.Model()\n",
    "stream=parser.parse_into_model(model,url)\n",
    "for triple in model:\n",
    "    print(triple.subject, triple.predicate, triple.object)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/",
     "height": 827
    },
    "id": "0qQWOXKgqyjD",
    "outputId": "0e744eaf-0af8-4402-d2ea-b69cb5653305",
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>mondo_uri</th>\n",
       "      <th>mondoid</th>\n",
       "      <th>label</th>\n",
       "      <th>exactMatches</th>\n",
       "      <th>aliases</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0014972</td>\n",
       "      <td>MONDO:0014972</td>\n",
       "      <td>chromosome 19q13.11 deletion syndrome, proximal</td>\n",
       "      <td>http://identifiers.org/omim/617219|http://link...</td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0017899</td>\n",
       "      <td>MONDO:0017899</td>\n",
       "      <td>autosomal dominant mendelian susceptibility to...</td>\n",
       "      <td>http://linkedlifedata.com/resource/umls/id/CN2...</td>\n",
       "      <td>autosomal dominant MSMD due to a partial defic...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/HP_0012210</td>\n",
       "      <td>HP:0012210</td>\n",
       "      <td>Abnormal renal morphology</td>\n",
       "      <td></td>\n",
       "      <td>Kidney structure issue|Structural kidney abnor...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0019888</td>\n",
       "      <td>MONDO:0019888</td>\n",
       "      <td>distal trisomy 20q</td>\n",
       "      <td>http://identifiers.org/snomedct/764500002|http...</td>\n",
       "      <td>telomeric duplication 20q|distal duplication 2...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0009339</td>\n",
       "      <td>MONDO:0009339</td>\n",
       "      <td>congenital bile acid synthesis defect 2</td>\n",
       "      <td>http://identifiers.org/mesh/C535443|http://ide...</td>\n",
       "      <td>CBAS2|bile acid synthesis defect, congenital, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26753</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0002144</td>\n",
       "      <td>MONDO:0002144</td>\n",
       "      <td>obsolete hyperuricemia (disease)</td>\n",
       "      <td>http://purl.obolibrary.org/obo/DOID_1920|http:...</td>\n",
       "      <td>hyperuricemia|uricacidemia|blood urate raized|...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26754</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0021680</td>\n",
       "      <td>MONDO:0021680</td>\n",
       "      <td>streptococcal infection</td>\n",
       "      <td>http://identifiers.org/snomedct/85769006|http:...</td>\n",
       "      <td>Streptococcus caused disease or disorder|Strep...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26755</th>\n",
       "      <td>http://purl.obolibrary.org/obo/NCBITaxon_28221</td>\n",
       "      <td>NCBITaxon:28221</td>\n",
       "      <td>Deltaproteobacteria</td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26756</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0010030</td>\n",
       "      <td>MONDO:0010030</td>\n",
       "      <td>Sjogren syndrome</td>\n",
       "      <td>http://purl.obolibrary.org/obo/DOID_12894|http...</td>\n",
       "      <td>primary Sjögren-Gougerot syndrome|primary Sjog...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26757</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0044092</td>\n",
       "      <td>MONDO:0044092</td>\n",
       "      <td>collagenous sprue</td>\n",
       "      <td>http://purl.obolibrary.org/obo/NCIT_C45426|htt...</td>\n",
       "      <td>collagenous sprue|non-gluten sensitive enterop...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>26758 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            mondo_uri          mondoid  \\\n",
       "0        http://purl.obolibrary.org/obo/MONDO_0014972    MONDO:0014972   \n",
       "1        http://purl.obolibrary.org/obo/MONDO_0017899    MONDO:0017899   \n",
       "2           http://purl.obolibrary.org/obo/HP_0012210       HP:0012210   \n",
       "3        http://purl.obolibrary.org/obo/MONDO_0019888    MONDO:0019888   \n",
       "4        http://purl.obolibrary.org/obo/MONDO_0009339    MONDO:0009339   \n",
       "...                                               ...              ...   \n",
       "26753    http://purl.obolibrary.org/obo/MONDO_0002144    MONDO:0002144   \n",
       "26754    http://purl.obolibrary.org/obo/MONDO_0021680    MONDO:0021680   \n",
       "26755  http://purl.obolibrary.org/obo/NCBITaxon_28221  NCBITaxon:28221   \n",
       "26756    http://purl.obolibrary.org/obo/MONDO_0010030    MONDO:0010030   \n",
       "26757    http://purl.obolibrary.org/obo/MONDO_0044092    MONDO:0044092   \n",
       "\n",
       "                                                   label  \\\n",
       "0        chromosome 19q13.11 deletion syndrome, proximal   \n",
       "1      autosomal dominant mendelian susceptibility to...   \n",
       "2                              Abnormal renal morphology   \n",
       "3                                     distal trisomy 20q   \n",
       "4                congenital bile acid synthesis defect 2   \n",
       "...                                                  ...   \n",
       "26753                   obsolete hyperuricemia (disease)   \n",
       "26754                            streptococcal infection   \n",
       "26755                                Deltaproteobacteria   \n",
       "26756                                   Sjogren syndrome   \n",
       "26757                                  collagenous sprue   \n",
       "\n",
       "                                            exactMatches  \\\n",
       "0      http://identifiers.org/omim/617219|http://link...   \n",
       "1      http://linkedlifedata.com/resource/umls/id/CN2...   \n",
       "2                                                          \n",
       "3      http://identifiers.org/snomedct/764500002|http...   \n",
       "4      http://identifiers.org/mesh/C535443|http://ide...   \n",
       "...                                                  ...   \n",
       "26753  http://purl.obolibrary.org/obo/DOID_1920|http:...   \n",
       "26754  http://identifiers.org/snomedct/85769006|http:...   \n",
       "26755                                                      \n",
       "26756  http://purl.obolibrary.org/obo/DOID_12894|http...   \n",
       "26757  http://purl.obolibrary.org/obo/NCIT_C45426|htt...   \n",
       "\n",
       "                                                 aliases  \n",
       "0                                                         \n",
       "1      autosomal dominant MSMD due to a partial defic...  \n",
       "2      Kidney structure issue|Structural kidney abnor...  \n",
       "3      telomeric duplication 20q|distal duplication 2...  \n",
       "4      CBAS2|bile acid synthesis defect, congenital, ...  \n",
       "...                                                  ...  \n",
       "26753  hyperuricemia|uricacidemia|blood urate raized|...  \n",
       "26754  Streptococcus caused disease or disorder|Strep...  \n",
       "26755                                                     \n",
       "26756  primary Sjögren-Gougerot syndrome|primary Sjog...  \n",
       "26757  collagenous sprue|non-gluten sensitive enterop...  \n",
       "\n",
       "[26758 rows x 5 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pprint\n",
    "df_mondoNative = pd.DataFrame(columns=[\"mondo_uri\", \"mondoid\", \"label\", \"exactMatches\", \"aliases\"])\n",
    "\n",
    "qres = doGraph.query(\n",
    "    \"\"\"\n",
    "       PREFIX obo: <http://www.geneontology.org/formats/oboInOwl#>\n",
    "       PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "       PREFIX oboInOwl: <http://www.geneontology.org/formats/oboInOwl#>\n",
    "\n",
    "       SELECT DISTINCT ?mondo_uri ?mondoid ?label (GROUP_CONCAT(?exactMatch;separator=\"|\") as ?exactMatches) (GROUP_CONCAT(?exactsynonym;separator=\"|\") as ?exact_synonyms)\n",
    "       WHERE {\n",
    "          ?mondo_uri obo:id ?mondoid ;\n",
    "                  rdfs:label ?label .\n",
    "         OPTIONAL {?mondo_uri <http://www.w3.org/2004/02/skos/core#exactMatch> ?exactMatch .}\n",
    "         OPTIONAL {?mondo_uri oboInOwl:hasExactSynonym ?exactsynonym}\n",
    "       }\n",
    "       GROUP BY ?mondo_uri \"\"\")\n",
    "\n",
    "for row in qres:\n",
    "    df_mondoNative = df_mondoNative.append({\n",
    "     \"mondo_uri\": str(row[0]),\n",
    "     \"mondoid\": str(row[1]),\n",
    "     \"label\":  str(row[2]),\n",
    "     \"exactMatches\": str(row[3]),\n",
    "     \"aliases\": str(row[4])\n",
    "      }, ignore_index=True)\n",
    "\n",
    "df_mondoNative\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/",
     "height": 356
    },
    "id": "MhYoAfBiSAro",
    "outputId": "ca768b81-aac0-452f-b49d-7b69020334e0",
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "from wikidataintegrator.wdi_helpers import try_write\n",
    "from getpass import getpass\n",
    "\n",
    "wikibase = \"https://diseases.semscape.org/w/api.php\"\n",
    "WBUSER = getpass(prompt=\"username:\")  \n",
    "WBPASS = getpass(prompt='Enter your password: ')  \n",
    "login = wdi_login.WDLogin(WBUSER, WBPASS, mediawiki_api_url=wikibase)\n",
    "\n",
    "query = \"\"\"\n",
    "  PREFIX wbt: <http://diseases.semscape.org/prop/direct/>\n",
    "  SELECT * WHERE {?item wbt:P5 ?exactMatch}\n",
    "\"\"\"\n",
    "existing_disease = dict()\n",
    "results =  wdi_core.WDItemEngine.execute_sparql_query(query=query, endpoint=\"https://diseases.semscape.org/query/sparql\")\n",
    "\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    existing_disease[result[\"exactMatch\"][\"value\"]] = result[\"item\"][\"value\"]\n",
    "\n",
    "for index, row in df_mondoNative.iterrows():\n",
    "  data = []\n",
    "  mondo_reference = createMONDOReference(row[\"mondoid\"])\n",
    "  # Mondo ID\n",
    "  data.append(wdi_core.WDExternalID(row[\"mondoid\"], prop_nr=\"P9\", references=[copy.deepcopy(mondo_reference)]))\n",
    "  data.append(wdi_core.WDUrl(row[\"mondo_uri\"], prop_nr=\"P5\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "  # exact matches\n",
    "  for skosExactMatch in list(set(row[\"exactMatches\"].split(\"|\"))):\n",
    "      if skosExactMatch != \"\":\n",
    "          data.append(wdi_core.WDUrl(skosExactMatch, prop_nr=\"P5\", references=[copy.deepcopy(mondo_reference)]))\n",
    "          # Disease Ontology ID (P4)\n",
    "          # http://purl.obolibrary.org/obo/DOID_xxxxx\n",
    "          if \"http://purl.obolibrary.org/obo/DOID\" in skosExactMatch:\n",
    "              doid = skosExactMatch.replace(\"http://purl.obolibrary.org/obo/DOID_\", \"DOID:\")\n",
    "              data.append(wdi_core.WDExternalID(doid, prop_nr=\"P4\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "          # MeSH descriptor ID (P8)\n",
    "          # http://identifiers.org/mesh/\n",
    "          if \"http://identifiers.org/mesh/\" in skosExactMatch:\n",
    "              mesh = skosExactMatch.replace(\"http://identifiers.org/mesh/\", \"\")\n",
    "              data.append(wdi_core.WDExternalID(mesh, prop_nr=\"P8\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "          # UMLS CUI (P10)\n",
    "          # http://linkedlifedata.com/resource/umls/id/\n",
    "          if \"http://linkedlifedata.com/resource/umls/id/\" in skosExactMatch:\n",
    "              umls = skosExactMatch.replace(\"http://linkedlifedata.com/resource/umls/id/\", \"\")\n",
    "              data.append(wdi_core.WDExternalID(umls, prop_nr=\"P10\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "          # Orphanet ID (P11)\n",
    "          # http://www.orpha.net/ORDO/Orphanet_\n",
    "          if \"http://www.orpha.net/ORDO/Orphanet_\" in skosExactMatch:\n",
    "              ordo = skosExactMatch.replace(\"http://www.orpha.net/ORDO/\", \"\")\n",
    "              data.append(wdi_core.WDExternalID(ordo, prop_nr=\"P11\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "          # SNOMED CT identifier (P12)\n",
    "          # http://identifiers.org/snomedct/191347008\n",
    "          if \"http://identifiers.org/snomedct/\" in skosExactMatch:\n",
    "              snomed = skosExactMatch.replace(\"http://identifiers.org/snomedct/\", \"\")\n",
    "              data.append(wdi_core.WDExternalID(snomed, prop_nr=\"P12\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "          # NCI Thesaurus ID (P13)\n",
    "          # http://purl.obolibrary.org/obo/NCIT_\n",
    "          if \"http://purl.obolibrary.org/obo/NCIT_\" in skosExactMatch:\n",
    "              ncit = skosExactMatch.replace(\"http://purl.obolibrary.org/obo/NCIT_\", \"NCIT:\")\n",
    "              data.append(wdi_core.WDString(ncit, prop_nr=\"P13\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "          # OMIM (P14)\n",
    "          # http://identifiers.org/omim/\n",
    "          if \"http://identifiers.org/omim/\" in skosExactMatch:\n",
    "              omim = skosExactMatch.replace(\"http://identifiers.org/omim/\", \"\")\n",
    "              data.append(wdi_core.WDExternalID(omim, prop_nr=\"P14\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "  qid = None\n",
    "  for exactMatch in row[\"exactMatches\"].split(\"|\"):\n",
    "    if exactMatch in existing_disease.keys():\n",
    "      qid = existing_disease[exactMatch].replace(\"http://diseases.semscape.org/entity/\", \"\")\n",
    "    continue\n",
    "  if not qid:\n",
    "    wb_mondo_item = wdi_core.WDItemEngine(data=data, mediawiki_api_url=wikibase, sparql_endpoint_url=\"https://diseases.semscape.org/query/sparql\", keep_good_ref_statements=True)\n",
    "  else:\n",
    "    wb_mondo_item = wdi_core.WDItemEngine(wd_item_id=qid, data=data, mediawiki_api_url=wikibase, sparql_endpoint_url=\"https://diseases.semscape.org/query/sparql\", keep_good_ref_statements=True)\n",
    "  \n",
    "  if wb_mondo_item.get_label() == \"\":\n",
    "    wb_mondo_item.set_label(row[\"label\"], lang=\"en\")\n",
    "  if wb_mondo_item.get_description() == \"\":\n",
    "    wb_mondo_item.set_description(\"human disease\", lang=\"en\")\n",
    "  if row[\"aliases\"] != \"\":\n",
    "    print(row[\"aliases\"])\n",
    "    aliases = wb_mondo_item.get_aliases()\n",
    "    for new_alias in row[\"aliases\"].split(\"|\"):\n",
    "       aliases.append(new_alias)\n",
    "    wb_mondo_item.set_aliases(aliases, lang=\"en\")\n",
    "  #pprint.pprint(wb_mondo_item.get_wd_json_representation())\n",
    "  print(wb_mondo_item.wd_item_id)\n",
    "  try_write(wb_mondo_item, record_id=row[\"mondoid\"], record_prop=\"P4\", edit_summary=\"Updated a MondoID\", login=login)\n",
    "  sys.exit()\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/",
     "height": 590
    },
    "id": "w1iH4tJ7q_yz",
    "outputId": "46ff840f-4398-43a2-c194-c9fe72242776",
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "  PREFIX wbt: <http://diseases.semscape.org/prop/direct/>\n",
    "  SELECT * WHERE {?item wbt:P4 ?doid}\n",
    "\"\"\"\n",
    "existing_do = dict()\n",
    "results =  wdi_core.WDItemEngine.execute_sparql_query(query=query, endpoint=\"https://diseases.semscape.org/query/sparql\")\n",
    "pprint.pprint(results)\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    existing_do[result[\"doid\"][\"value\"]] = result[\"item\"][\"value\"]\n",
    "\n",
    "existing_do"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/",
     "height": 52
    },
    "id": "cXt3r7UGiRck",
    "outputId": "7f8c0530-fb3e-4ddc-f64b-ee2d8e2c926f",
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "qres = doGraph.query(\n",
    "    \"\"\"\n",
    "      \n",
    "\n",
    "       SELECT ?source ?target WHERE {\n",
    "\n",
    "       ?s <http://www.w3.org/2004/02/skos/core#exactMatch> ?o ;\n",
    "          <http://www.w3.org/2002/07/owl#annotatedSource> ?source ;\n",
    "          <http://www.w3.org/2002/07/owl#annotatedTarget> ?target .\n",
    "\n",
    "\n",
    "  }\n",
    "       \"\"\")\n",
    "\n",
    "for row in qres:\n",
    "  print(row[0], row[1])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/",
     "height": 1000
    },
    "id": "fFWJJu4cJnzQ",
    "outputId": "e9b71591-0155-412c-f740-35e6a7cbf001",
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "qres = doGraph.query(\n",
    "    \"\"\"\n",
    "      SELECT DISTINCT ?source ?target ?doid ?mesh WHERE {\n",
    "          ?source <http://www.w3.org/2004/02/skos/core#exactMatch> ?target .\n",
    "          OPTIONAL {?source <http://www.w3.org/2004/02/skos/core#exactMatch> ?doid .}\n",
    "          OPTIONAL {?source <http://www.w3.org/2004/02/skos/core#exactMatch> ?mesh .}\n",
    "          FILTER REGEX(str(?doid), \"DOID\", \"i\")\n",
    "      }\n",
    "    \"\"\"\n",
    ")\n",
    "for row in qres:\n",
    "  print(row[0], row[1])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/",
     "height": 1000
    },
    "id": "kVt4GuuY4pNn",
    "outputId": "f66474ce-9946-4b7c-c17f-87a8adaa30ff",
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>mondo_uri</th>\n",
       "      <th>mondoid</th>\n",
       "      <th>label</th>\n",
       "      <th>exactMatches</th>\n",
       "      <th>aliases</th>\n",
       "      <th>qid</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0014972</td>\n",
       "      <td>MONDO:0014972</td>\n",
       "      <td>chromosome 19q13.11 deletion syndrome, proximal</td>\n",
       "      <td>http://identifiers.org/omim/617219|http://link...</td>\n",
       "      <td></td>\n",
       "      <td>http://www.wikidata.org/entity/Q55785152</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0017899</td>\n",
       "      <td>MONDO:0017899</td>\n",
       "      <td>autosomal dominant mendelian susceptibility to...</td>\n",
       "      <td>http://linkedlifedata.com/resource/umls/id/CN2...</td>\n",
       "      <td>autosomal dominant MSMD due to a partial defic...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q55787487</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0019888</td>\n",
       "      <td>MONDO:0019888</td>\n",
       "      <td>distal trisomy 20q</td>\n",
       "      <td>http://identifiers.org/snomedct/764500002|http...</td>\n",
       "      <td>telomeric duplication 20q|distal duplication 2...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q55788957</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0009339</td>\n",
       "      <td>MONDO:0009339</td>\n",
       "      <td>congenital bile acid synthesis defect 2</td>\n",
       "      <td>http://identifiers.org/mesh/C535443|http://ide...</td>\n",
       "      <td>CBAS2|bile acid synthesis defect, congenital, ...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q42863601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0009583</td>\n",
       "      <td>MONDO:0009583</td>\n",
       "      <td>blepharophimosis - intellectual disability syn...</td>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_2728|http:/...</td>\n",
       "      <td>Ohdo-Madokoro-Sonoda syndrome|BMRS, Ohdo type|...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q3961681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17687</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0033282</td>\n",
       "      <td>MONDO:0033282</td>\n",
       "      <td>multiple mitochondrial dysfunctions syndrome 5</td>\n",
       "      <td>http://purl.obolibrary.org/obo/DOID_0080274|ht...</td>\n",
       "      <td></td>\n",
       "      <td>http://www.wikidata.org/entity/Q53661614</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17688</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0024642</td>\n",
       "      <td>MONDO:0024642</td>\n",
       "      <td>gastric neuroendocrine tumor G2</td>\n",
       "      <td>http://linkedlifedata.com/resource/umls/id/C32...</td>\n",
       "      <td>gastric NET G2|gastric neuroendocrine tumor G2...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q55790735</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17689</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0002144</td>\n",
       "      <td>MONDO:0002144</td>\n",
       "      <td>obsolete hyperuricemia (disease)</td>\n",
       "      <td>http://purl.obolibrary.org/obo/DOID_1920|http:...</td>\n",
       "      <td>hyperuricemia|uricacidemia|blood urate raized|...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q49970</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17690</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0021680</td>\n",
       "      <td>MONDO:0021680</td>\n",
       "      <td>streptococcal infection</td>\n",
       "      <td>http://identifiers.org/snomedct/85769006|http:...</td>\n",
       "      <td>Streptococcus caused disease or disorder|Strep...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q5849703</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17691</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0010030</td>\n",
       "      <td>MONDO:0010030</td>\n",
       "      <td>Sjogren syndrome</td>\n",
       "      <td>http://purl.obolibrary.org/obo/DOID_12894|http...</td>\n",
       "      <td>primary Sjögren-Gougerot syndrome|primary Sjog...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q335555</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>17692 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                          mondo_uri        mondoid  \\\n",
       "0      http://purl.obolibrary.org/obo/MONDO_0014972  MONDO:0014972   \n",
       "1      http://purl.obolibrary.org/obo/MONDO_0017899  MONDO:0017899   \n",
       "2      http://purl.obolibrary.org/obo/MONDO_0019888  MONDO:0019888   \n",
       "3      http://purl.obolibrary.org/obo/MONDO_0009339  MONDO:0009339   \n",
       "4      http://purl.obolibrary.org/obo/MONDO_0009583  MONDO:0009583   \n",
       "...                                             ...            ...   \n",
       "17687  http://purl.obolibrary.org/obo/MONDO_0033282  MONDO:0033282   \n",
       "17688  http://purl.obolibrary.org/obo/MONDO_0024642  MONDO:0024642   \n",
       "17689  http://purl.obolibrary.org/obo/MONDO_0002144  MONDO:0002144   \n",
       "17690  http://purl.obolibrary.org/obo/MONDO_0021680  MONDO:0021680   \n",
       "17691  http://purl.obolibrary.org/obo/MONDO_0010030  MONDO:0010030   \n",
       "\n",
       "                                                   label  \\\n",
       "0        chromosome 19q13.11 deletion syndrome, proximal   \n",
       "1      autosomal dominant mendelian susceptibility to...   \n",
       "2                                     distal trisomy 20q   \n",
       "3                congenital bile acid synthesis defect 2   \n",
       "4      blepharophimosis - intellectual disability syn...   \n",
       "...                                                  ...   \n",
       "17687     multiple mitochondrial dysfunctions syndrome 5   \n",
       "17688                    gastric neuroendocrine tumor G2   \n",
       "17689                   obsolete hyperuricemia (disease)   \n",
       "17690                            streptococcal infection   \n",
       "17691                                   Sjogren syndrome   \n",
       "\n",
       "                                            exactMatches  \\\n",
       "0      http://identifiers.org/omim/617219|http://link...   \n",
       "1      http://linkedlifedata.com/resource/umls/id/CN2...   \n",
       "2      http://identifiers.org/snomedct/764500002|http...   \n",
       "3      http://identifiers.org/mesh/C535443|http://ide...   \n",
       "4      http://www.orpha.net/ORDO/Orphanet_2728|http:/...   \n",
       "...                                                  ...   \n",
       "17687  http://purl.obolibrary.org/obo/DOID_0080274|ht...   \n",
       "17688  http://linkedlifedata.com/resource/umls/id/C32...   \n",
       "17689  http://purl.obolibrary.org/obo/DOID_1920|http:...   \n",
       "17690  http://identifiers.org/snomedct/85769006|http:...   \n",
       "17691  http://purl.obolibrary.org/obo/DOID_12894|http...   \n",
       "\n",
       "                                                 aliases  \\\n",
       "0                                                          \n",
       "1      autosomal dominant MSMD due to a partial defic...   \n",
       "2      telomeric duplication 20q|distal duplication 2...   \n",
       "3      CBAS2|bile acid synthesis defect, congenital, ...   \n",
       "4      Ohdo-Madokoro-Sonoda syndrome|BMRS, Ohdo type|...   \n",
       "...                                                  ...   \n",
       "17687                                                      \n",
       "17688  gastric NET G2|gastric neuroendocrine tumor G2...   \n",
       "17689  hyperuricemia|uricacidemia|blood urate raized|...   \n",
       "17690  Streptococcus caused disease or disorder|Strep...   \n",
       "17691  primary Sjögren-Gougerot syndrome|primary Sjog...   \n",
       "\n",
       "                                            qid  \n",
       "0      http://www.wikidata.org/entity/Q55785152  \n",
       "1      http://www.wikidata.org/entity/Q55787487  \n",
       "2      http://www.wikidata.org/entity/Q55788957  \n",
       "3      http://www.wikidata.org/entity/Q42863601  \n",
       "4       http://www.wikidata.org/entity/Q3961681  \n",
       "...                                         ...  \n",
       "17687  http://www.wikidata.org/entity/Q53661614  \n",
       "17688  http://www.wikidata.org/entity/Q55790735  \n",
       "17689     http://www.wikidata.org/entity/Q49970  \n",
       "17690   http://www.wikidata.org/entity/Q5849703  \n",
       "17691    http://www.wikidata.org/entity/Q335555  \n",
       "\n",
       "[17692 rows x 6 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"SELECT * WHERE { ?qid wdt:P5270 ?mondoid}\"\n",
    "mondoinwd = wdi_core.WDFunctionsEngine.execute_sparql_query(query, as_dataframe=True)\n",
    "mondoinwd\n",
    "workdata = df_mondoNative.merge(mondoinwd, on=\"mondoid\")\n",
    "workdata"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/",
     "height": 555
    },
    "id": "MlnKWwGu74Ps",
    "outputId": "4919378c-9928-4c49-e06c-1483711bcf15",
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q55785152\n",
      "Q55785152$5E23CBBA-BEF0-45C7-A730-033FA5711598\n",
      "Q55785152$57CF6EC2-68F6-4B7D-A349-8D00603981C9\n",
      "Q55785152$80139B9D-A91C-42E8-8655-65788715DBA1\n",
      "Q55785152$BFB36CF5-E9EB-4844-826B-EC299BB70688\n",
      "Q55785152$3B33E106-E63F-44B5-9DB4-64685061307B\n",
      "Q55785152$F0D9BF5F-4BFB-4108-960C-CD68E9DD26CE\n",
      "http://purl.obolibrary.org/obo/MONDO_0000761\n",
      "Q55785152\n",
      "Q55787487\n",
      "Q55787487$F558F27D-21C5-4385-8EE3-1B07E527F3D3\n",
      "{'pageinfo': {'lastrevid': 1318784844}, 'success': 1, 'claims': ['Q55787487$F558F27D-21C5-4385-8EE3-1B07E527F3D3']}\n",
      "Q55787487$3BCEDB25-0DC1-469A-B9C6-CD4BC70F6ED9\n",
      "{'pageinfo': {'lastrevid': 1318784858}, 'success': 1, 'claims': ['Q55787487$3BCEDB25-0DC1-469A-B9C6-CD4BC70F6ED9']}\n",
      "Q55787487$C608E0FC-92A1-4599-AF75-1EEBA9D2FC7F\n",
      "http://purl.obolibrary.org/obo/MONDO_0020637\n",
      "Q55787487\n",
      "Q55788957\n",
      "Q55788957$8F6B6429-EE90-44B3-B336-14F17E62E464\n",
      "{'pageinfo': {'lastrevid': 1318784909}, 'success': 1, 'claims': ['Q55788957$8F6B6429-EE90-44B3-B336-14F17E62E464']}\n",
      "Q55788957$F13F7CEE-6B01-47B0-8887-1490FCE6EC68\n",
      "{'pageinfo': {'lastrevid': 1318784920}, 'success': 1, 'claims': ['Q55788957$F13F7CEE-6B01-47B0-8887-1490FCE6EC68']}\n",
      "Q55788957$6E888C55-5AC8-43F7-9A49-F285288F06E3\n",
      "{'pageinfo': {'lastrevid': 1318784927}, 'success': 1, 'claims': ['Q55788957$6E888C55-5AC8-43F7-9A49-F285288F06E3']}\n",
      "Q55788957$01833EB3-E6F5-45BC-8EA4-3C415DFBA46B\n",
      "{'pageinfo': {'lastrevid': 1318784933}, 'success': 1, 'claims': ['Q55788957$01833EB3-E6F5-45BC-8EA4-3C415DFBA46B']}\n",
      "Q55788957$A27AF262-2FF8-453F-B62D-B1B65E6270E0\n",
      "http://purl.obolibrary.org/obo/MONDO_0016970\n",
      "Q55788957\n",
      "Q42863601\n",
      "Q42863601$7FA7CB4C-5D61-45BD-B9C3-8B99F5CAFB3A\n",
      "{'pageinfo': {'lastrevid': 1318784973}, 'success': 1, 'claims': ['Q42863601$7FA7CB4C-5D61-45BD-B9C3-8B99F5CAFB3A']}\n",
      "Q42863601$6F8298F7-E4B2-4480-ADA4-0CDB1D44B690\n",
      "Q42863601$78A21E6E-4042-42F9-9610-31F328EA805F\n",
      "Q42863601$239CA223-FADF-4EEF-9092-F37126239C54\n",
      "Q42863601$248FBD1D-9B71-4A79-8AD6-50EA1DA78D8B\n",
      "Q42863601$990AABA7-2A34-45BA-B8C8-FF057A284005\n",
      "Q42863601$99A41321-B2F1-4BC1-AA6E-3AA4D45E15E9\n",
      "Q42863601$96E56340-08B1-42E2-BC37-D72548F473B5\n",
      "Q42863601$088A74FE-732E-4890-ADF0-CE00B0B76CC0\n",
      "Q42863601$3CA7D61A-7F12-4258-AE80-97A77A177609\n",
      "Q42863601$EFAE68B9-69B3-44CE-9654-11A43E99FBBB\n",
      "{'pageinfo': {'lastrevid': 1318784982}, 'success': 1, 'claims': ['Q42863601$EFAE68B9-69B3-44CE-9654-11A43E99FBBB']}\n",
      "Q42863601$07E79185-2683-49E7-896B-26AFA328E53E\n",
      "Q42863601$58147B54-0263-4C0B-A011-6EB55C3BB035\n",
      "{'pageinfo': {'lastrevid': 1318784988}, 'success': 1, 'claims': ['Q42863601$58147B54-0263-4C0B-A011-6EB55C3BB035']}\n",
      "Q42863601$9AFDEE10-C57F-452C-B7E9-48A91FF14BA0\n",
      "Q42863601$3EDFF637-77B8-4F75-9D7D-609D3F81EBD3\n",
      "Q42863601$4732AE24-FCCA-42EF-8B99-F02B4B65DCD0\n",
      "http://purl.obolibrary.org/obo/MONDO_0018841\n",
      "Q42863601\n",
      "Q3961681\n",
      "Q3961681$416FF978-867B-45B5-ADA6-202FEB846052\n",
      "Q3961681$33A3CBAA-75CD-48CF-A27E-A2925304E0FD\n",
      "Q3961681$751030CD-2C21-4651-AC6D-1F21CB93D3A5\n",
      "Q3961681$15A277BA-34CB-4B23-8E3C-F8158444256A\n",
      "{'pageinfo': {'lastrevid': 1318785042}, 'success': 1, 'claims': ['Q3961681$15A277BA-34CB-4B23-8E3C-F8158444256A']}\n",
      "Q3961681$7F3391A3-0157-43A3-A684-9FA4C5F33DFD\n",
      "Q3961681$CCD956FD-0E79-465A-9A4E-DF7459C67664\n",
      "{'pageinfo': {'lastrevid': 1318785052}, 'success': 1, 'claims': ['Q3961681$CCD956FD-0E79-465A-9A4E-DF7459C67664']}\n",
      "Q3961681$39BBE7EB-99D6-46BB-B7A1-B64D90F4431D\n",
      "Q3961681$52BE8657-D897-4112-8BC1-BA7DBC7310D2\n",
      "Q3961681$554645a7-49a6-97e0-a730-4e191e0c76f6\n",
      "Q3961681$B061305F-4F9A-4070-97BD-B11FCE2D2A56\n",
      "Q3961681$219FB7B1-BA3F-47CC-A6B3-D375A7690488\n",
      "Q3961681$BA2EABE1-C2EE-4648-9237-1D3121DEE373\n",
      "Q3961681$EC9B1134-FAC6-465D-AF1A-DDA7A50419A1\n",
      "Q3961681$D3606376-57B3-4247-BB97-B531F4782E40\n",
      "{'pageinfo': {'lastrevid': 1318785064}, 'success': 1, 'claims': ['Q3961681$D3606376-57B3-4247-BB97-B531F4782E40']}\n",
      "Q3961681$AF7FA9AE-1E8E-4BFC-BE5D-CAA1ACC5EC41\n",
      "{'pageinfo': {'lastrevid': 1318785073}, 'success': 1, 'claims': ['Q3961681$AF7FA9AE-1E8E-4BFC-BE5D-CAA1ACC5EC41']}\n",
      "Q3961681$BCD99307-6A24-439A-8316-BB33ACEF1927\n",
      "{'pageinfo': {'lastrevid': 1318785086}, 'success': 1, 'claims': ['Q3961681$BCD99307-6A24-439A-8316-BB33ACEF1927']}\n",
      "Q3961681$E21738AB-EEB5-4A80-8D7C-9F6411E94055\n",
      "Q3961681$0DAC0194-1A5E-499B-899A-B213C884D15F\n",
      "{'pageinfo': {'lastrevid': 1318785099}, 'success': 1, 'claims': ['Q3961681$0DAC0194-1A5E-499B-899A-B213C884D15F']}\n",
      "Q3961681$A3FAE260-4674-42DD-88D2-0AA8F97E976B\n",
      "{'pageinfo': {'lastrevid': 1318785107}, 'success': 1, 'claims': ['Q3961681$A3FAE260-4674-42DD-88D2-0AA8F97E976B']}\n",
      "Q3961681$4D58C072-3545-42B4-9366-E4FAA440A11F\n",
      "Q3961681$4D5ABE78-FB18-4918-9925-272AA200FCB5\n",
      "Q3961681$F53EB4BC-4832-49DF-AC02-5D4F9FE09E21\n",
      "http://purl.obolibrary.org/obo/MONDO_0000734\n",
      "Q3961681\n",
      "Q56014143\n",
      "Q56014143$C98BA095-B47D-46EE-A681-CAEE82CAA41E\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001B[0;31m---------------------------------------------------------------------------\u001B[0m",
      "\u001B[0;31mKeyboardInterrupt\u001B[0m                         Traceback (most recent call last)",
      "\u001B[0;32m<ipython-input-23-d7002ca373db>\u001B[0m in \u001B[0;36m<module>\u001B[0;34m\u001B[0m\n\u001B[1;32m    110\u001B[0m         \u001B[0mitem\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mwdi_core\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mWDItemEngine\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mwd_item_id\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mqid\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mdata\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mdata\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    111\u001B[0m         \u001B[0mprint\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mitem\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mwrite\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mlogin\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 112\u001B[0;31m         \u001B[0mremove_mondo_ref\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mqid\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    113\u001B[0m         \u001B[0mprint\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mupdateMondo\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mrow\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    114\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m<ipython-input-23-d7002ca373db>\u001B[0m in \u001B[0;36mremove_mondo_ref\u001B[0;34m(qid)\u001B[0m\n\u001B[1;32m     22\u001B[0m                 \u001B[0;32mfor\u001B[0m \u001B[0msnakP248\u001B[0m \u001B[0;32min\u001B[0m \u001B[0mreference\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m\"snaks\"\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m\"P248\"\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m     23\u001B[0m                     \u001B[0;32mif\u001B[0m \u001B[0msnakP248\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m\"datavalue\"\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m\"value\"\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m\"id\"\u001B[0m\u001B[0;34m]\u001B[0m \u001B[0;34m==\u001B[0m \u001B[0;34m\"Q55345445\"\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m---> 24\u001B[0;31m                         \u001B[0mwdi_core\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mWDItemEngine\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mdelete_statement\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mstatement_id\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mclaim\u001B[0m\u001B[0;34m[\u001B[0m\u001B[0;34m\"id\"\u001B[0m\u001B[0;34m]\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mrevision\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mitem\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mlastrevid\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mlogin\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mlogin\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m     25\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m     26\u001B[0m \u001B[0;32mdef\u001B[0m \u001B[0mupdateMondo\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mrow\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/PycharmProjects/Gene_Wiki_Wikibase/venv/lib/python3.7/site-packages/wikidataintegrator/wdi_core.py\u001B[0m in \u001B[0;36mdelete_statement\u001B[0;34m(statement_id, revision, login, mediawiki_api_url, user_agent)\u001B[0m\n\u001B[1;32m   1608\u001B[0m             \u001B[0;34m'User-Agent'\u001B[0m\u001B[0;34m:\u001B[0m \u001B[0muser_agent\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1609\u001B[0m         }\n\u001B[0;32m-> 1610\u001B[0;31m         \u001B[0mr\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mrequests\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mpost\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0murl\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mmediawiki_api_url\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mdata\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mparams\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mcookies\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mlogin\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mget_edit_cookie\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mheaders\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mheaders\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m   1611\u001B[0m         \u001B[0mprint\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mr\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mjson\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1612\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/PycharmProjects/Gene_Wiki_Wikibase/venv/lib/python3.7/site-packages/requests/api.py\u001B[0m in \u001B[0;36mpost\u001B[0;34m(url, data, json, **kwargs)\u001B[0m\n\u001B[1;32m    114\u001B[0m     \"\"\"\n\u001B[1;32m    115\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 116\u001B[0;31m     \u001B[0;32mreturn\u001B[0m \u001B[0mrequest\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m'post'\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0murl\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mdata\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mdata\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mjson\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mjson\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m**\u001B[0m\u001B[0mkwargs\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    117\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    118\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/PycharmProjects/Gene_Wiki_Wikibase/venv/lib/python3.7/site-packages/requests/api.py\u001B[0m in \u001B[0;36mrequest\u001B[0;34m(method, url, **kwargs)\u001B[0m\n\u001B[1;32m     58\u001B[0m     \u001B[0;31m# cases, and look like a memory leak in others.\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m     59\u001B[0m     \u001B[0;32mwith\u001B[0m \u001B[0msessions\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mSession\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m \u001B[0;32mas\u001B[0m \u001B[0msession\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m---> 60\u001B[0;31m         \u001B[0;32mreturn\u001B[0m \u001B[0msession\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mrequest\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mmethod\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mmethod\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0murl\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0murl\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m**\u001B[0m\u001B[0mkwargs\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m     61\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m     62\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/PycharmProjects/Gene_Wiki_Wikibase/venv/lib/python3.7/site-packages/requests/sessions.py\u001B[0m in \u001B[0;36mrequest\u001B[0;34m(self, method, url, params, data, headers, cookies, files, auth, timeout, allow_redirects, proxies, hooks, stream, verify, cert, json)\u001B[0m\n\u001B[1;32m    531\u001B[0m         }\n\u001B[1;32m    532\u001B[0m         \u001B[0msend_kwargs\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mupdate\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0msettings\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 533\u001B[0;31m         \u001B[0mresp\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0msend\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mprep\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m**\u001B[0m\u001B[0msend_kwargs\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    534\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    535\u001B[0m         \u001B[0;32mreturn\u001B[0m \u001B[0mresp\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/PycharmProjects/Gene_Wiki_Wikibase/venv/lib/python3.7/site-packages/requests/sessions.py\u001B[0m in \u001B[0;36msend\u001B[0;34m(self, request, **kwargs)\u001B[0m\n\u001B[1;32m    644\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    645\u001B[0m         \u001B[0;31m# Send the request\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 646\u001B[0;31m         \u001B[0mr\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0madapter\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0msend\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mrequest\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m**\u001B[0m\u001B[0mkwargs\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    647\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    648\u001B[0m         \u001B[0;31m# Total elapsed time of the request (approximately)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/PycharmProjects/Gene_Wiki_Wikibase/venv/lib/python3.7/site-packages/requests/adapters.py\u001B[0m in \u001B[0;36msend\u001B[0;34m(self, request, stream, timeout, verify, cert, proxies)\u001B[0m\n\u001B[1;32m    447\u001B[0m                     \u001B[0mdecode_content\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0;32mFalse\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    448\u001B[0m                     \u001B[0mretries\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mmax_retries\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 449\u001B[0;31m                     \u001B[0mtimeout\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mtimeout\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    450\u001B[0m                 )\n\u001B[1;32m    451\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/PycharmProjects/Gene_Wiki_Wikibase/venv/lib/python3.7/site-packages/urllib3/connectionpool.py\u001B[0m in \u001B[0;36murlopen\u001B[0;34m(self, method, url, body, headers, retries, redirect, assert_same_host, timeout, pool_timeout, release_conn, chunked, body_pos, **response_kw)\u001B[0m\n\u001B[1;32m    670\u001B[0m                 \u001B[0mbody\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mbody\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    671\u001B[0m                 \u001B[0mheaders\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mheaders\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 672\u001B[0;31m                 \u001B[0mchunked\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mchunked\u001B[0m\u001B[0;34m,\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    673\u001B[0m             )\n\u001B[1;32m    674\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/PycharmProjects/Gene_Wiki_Wikibase/venv/lib/python3.7/site-packages/urllib3/connectionpool.py\u001B[0m in \u001B[0;36m_make_request\u001B[0;34m(self, conn, method, url, timeout, chunked, **httplib_request_kw)\u001B[0m\n\u001B[1;32m    419\u001B[0m                     \u001B[0;31m# Python 3 (including for exceptions like SystemExit).\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    420\u001B[0m                     \u001B[0;31m# Otherwise it looks like a bug in the code.\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 421\u001B[0;31m                     \u001B[0msix\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mraise_from\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0me\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;32mNone\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    422\u001B[0m         \u001B[0;32mexcept\u001B[0m \u001B[0;34m(\u001B[0m\u001B[0mSocketTimeout\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mBaseSSLError\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mSocketError\u001B[0m\u001B[0;34m)\u001B[0m \u001B[0;32mas\u001B[0m \u001B[0me\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    423\u001B[0m             \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0m_raise_timeout\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0merr\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0me\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0murl\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0murl\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mtimeout_value\u001B[0m\u001B[0;34m=\u001B[0m\u001B[0mread_timeout\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m~/PycharmProjects/Gene_Wiki_Wikibase/venv/lib/python3.7/site-packages/urllib3/packages/six.py\u001B[0m in \u001B[0;36mraise_from\u001B[0;34m(value, from_value)\u001B[0m\n",
      "\u001B[0;32m~/PycharmProjects/Gene_Wiki_Wikibase/venv/lib/python3.7/site-packages/urllib3/connectionpool.py\u001B[0m in \u001B[0;36m_make_request\u001B[0;34m(self, conn, method, url, timeout, chunked, **httplib_request_kw)\u001B[0m\n\u001B[1;32m    414\u001B[0m                 \u001B[0;31m# Python 3\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    415\u001B[0m                 \u001B[0;32mtry\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 416\u001B[0;31m                     \u001B[0mhttplib_response\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mconn\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mgetresponse\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    417\u001B[0m                 \u001B[0;32mexcept\u001B[0m \u001B[0mBaseException\u001B[0m \u001B[0;32mas\u001B[0m \u001B[0me\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    418\u001B[0m                     \u001B[0;31m# Remove the TypeError from the exception chain in\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m/Library/Developer/CommandLineTools/Library/Frameworks/Python3.framework/Versions/3.7/lib/python3.7/http/client.py\u001B[0m in \u001B[0;36mgetresponse\u001B[0;34m(self)\u001B[0m\n\u001B[1;32m   1319\u001B[0m         \u001B[0;32mtry\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1320\u001B[0m             \u001B[0;32mtry\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m-> 1321\u001B[0;31m                 \u001B[0mresponse\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mbegin\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m   1322\u001B[0m             \u001B[0;32mexcept\u001B[0m \u001B[0mConnectionError\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1323\u001B[0m                 \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mclose\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m/Library/Developer/CommandLineTools/Library/Frameworks/Python3.framework/Versions/3.7/lib/python3.7/http/client.py\u001B[0m in \u001B[0;36mbegin\u001B[0;34m(self)\u001B[0m\n\u001B[1;32m    294\u001B[0m         \u001B[0;31m# read until we get a non-100 response\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    295\u001B[0m         \u001B[0;32mwhile\u001B[0m \u001B[0;32mTrue\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 296\u001B[0;31m             \u001B[0mversion\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mstatus\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mreason\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0m_read_status\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    297\u001B[0m             \u001B[0;32mif\u001B[0m \u001B[0mstatus\u001B[0m \u001B[0;34m!=\u001B[0m \u001B[0mCONTINUE\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    298\u001B[0m                 \u001B[0;32mbreak\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m/Library/Developer/CommandLineTools/Library/Frameworks/Python3.framework/Versions/3.7/lib/python3.7/http/client.py\u001B[0m in \u001B[0;36m_read_status\u001B[0;34m(self)\u001B[0m\n\u001B[1;32m    255\u001B[0m \u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    256\u001B[0m     \u001B[0;32mdef\u001B[0m \u001B[0m_read_status\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mself\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 257\u001B[0;31m         \u001B[0mline\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0mstr\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mfp\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mreadline\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0m_MAXLINE\u001B[0m \u001B[0;34m+\u001B[0m \u001B[0;36m1\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0;34m\"iso-8859-1\"\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    258\u001B[0m         \u001B[0;32mif\u001B[0m \u001B[0mlen\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mline\u001B[0m\u001B[0;34m)\u001B[0m \u001B[0;34m>\u001B[0m \u001B[0m_MAXLINE\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    259\u001B[0m             \u001B[0;32mraise\u001B[0m \u001B[0mLineTooLong\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m\"status line\"\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m/Library/Developer/CommandLineTools/Library/Frameworks/Python3.framework/Versions/3.7/lib/python3.7/socket.py\u001B[0m in \u001B[0;36mreadinto\u001B[0;34m(self, b)\u001B[0m\n\u001B[1;32m    587\u001B[0m         \u001B[0;32mwhile\u001B[0m \u001B[0;32mTrue\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    588\u001B[0m             \u001B[0;32mtry\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 589\u001B[0;31m                 \u001B[0;32mreturn\u001B[0m \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0m_sock\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mrecv_into\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mb\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    590\u001B[0m             \u001B[0;32mexcept\u001B[0m \u001B[0mtimeout\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    591\u001B[0m                 \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0m_timeout_occurred\u001B[0m \u001B[0;34m=\u001B[0m \u001B[0;32mTrue\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m/Library/Developer/CommandLineTools/Library/Frameworks/Python3.framework/Versions/3.7/lib/python3.7/ssl.py\u001B[0m in \u001B[0;36mrecv_into\u001B[0;34m(self, buffer, nbytes, flags)\u001B[0m\n\u001B[1;32m   1050\u001B[0m                   \u001B[0;34m\"non-zero flags not allowed in calls to recv_into() on %s\"\u001B[0m \u001B[0;34m%\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1051\u001B[0m                   self.__class__)\n\u001B[0;32m-> 1052\u001B[0;31m             \u001B[0;32mreturn\u001B[0m \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mread\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mnbytes\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mbuffer\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m   1053\u001B[0m         \u001B[0;32melse\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m   1054\u001B[0m             \u001B[0;32mreturn\u001B[0m \u001B[0msuper\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mrecv_into\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mbuffer\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mnbytes\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mflags\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;32m/Library/Developer/CommandLineTools/Library/Frameworks/Python3.framework/Versions/3.7/lib/python3.7/ssl.py\u001B[0m in \u001B[0;36mread\u001B[0;34m(self, len, buffer)\u001B[0m\n\u001B[1;32m    909\u001B[0m         \u001B[0;32mtry\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    910\u001B[0m             \u001B[0;32mif\u001B[0m \u001B[0mbuffer\u001B[0m \u001B[0;32mis\u001B[0m \u001B[0;32mnot\u001B[0m \u001B[0;32mNone\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0;32m--> 911\u001B[0;31m                 \u001B[0;32mreturn\u001B[0m \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0m_sslobj\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mread\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mlen\u001B[0m\u001B[0;34m,\u001B[0m \u001B[0mbuffer\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[0m\u001B[1;32m    912\u001B[0m             \u001B[0;32melse\u001B[0m\u001B[0;34m:\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n\u001B[1;32m    913\u001B[0m                 \u001B[0;32mreturn\u001B[0m \u001B[0mself\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0m_sslobj\u001B[0m\u001B[0;34m.\u001B[0m\u001B[0mread\u001B[0m\u001B[0;34m(\u001B[0m\u001B[0mlen\u001B[0m\u001B[0;34m)\u001B[0m\u001B[0;34m\u001B[0m\u001B[0;34m\u001B[0m\u001B[0m\n",
      "\u001B[0;31mKeyboardInterrupt\u001B[0m: "
     ]
    }
   ],
   "source": [
    "from datetime import datetime\n",
    "import copy\n",
    "\n",
    "login = wdi_login.WDLogin(\"Andrawaag\", \"k1T0BoAUHKTj\")\n",
    "\n",
    "def createMONDOReference(doid):\n",
    "    statedin = wdi_core.WDItemID(\"Q27468140\", prop_nr=\"P248\", is_reference=True)\n",
    "    retrieved = datetime.now()\n",
    "    timeStringNow = retrieved.strftime(\"+%Y-%m-%dT00:00:00Z\")\n",
    "    refRetrieved = wdi_core.WDTime(timeStringNow, prop_nr=\"P813\", is_reference=True)\n",
    "    doid = wdi_core.WDExternalID(doid, prop_nr=\"P5270\", is_reference=True)\n",
    "    return [statedin, refRetrieved, doid]\n",
    "\n",
    "def remove_mondo_ref(qid):\n",
    "    item = wdi_core.WDItemEngine(wd_item_id=qid)\n",
    "    json = item.get_wd_json_representation()\n",
    "\n",
    "    for key in json[\"claims\"].keys():\n",
    "        for claim in json[\"claims\"][key]:\n",
    "            print(claim[\"id\"])\n",
    "            for reference in claim[\"references\"]:\n",
    "                for snakP248 in reference[\"snaks\"][\"P248\"]:\n",
    "                    if snakP248[\"datavalue\"][\"value\"][\"id\"] == \"Q55345445\":\n",
    "                        wdi_core.WDItemEngine.delete_statement(statement_id=claim[\"id\"], revision=item.lastrevid, login=login)\n",
    "\n",
    "def updateMondo(row):\n",
    "    statements = []\n",
    "    mondo_id = row[\"mondoid\"]\n",
    "    mondo_reference = createMONDOReference(mondo_id)\n",
    "\n",
    "    # Mondo ID\n",
    "    statements.append(wdi_core.WDExternalID(row[\"mondoid\"], prop_nr=\"P5270\", references=[copy.deepcopy(mondo_reference)]))\n",
    "    statements.append(wdi_core.WDUrl(row[\"mondo_uri\"], prop_nr=\"P2888\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "    # subclasses \n",
    "    query=\"\"\"PREFIX obo: <http://www.geneontology.org/formats/oboInOwl#>\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX oboInOwl: <http://www.geneontology.org/formats/oboInOwl#>\n",
    "\n",
    "        SELECT ?subClassOf WHERE {\"\"\"\n",
    "\n",
    "    query+= \"<\"+row[\"mondo_uri\"]+\"> rdfs:subClassOf ?subClassOf .  FILTER (REGEX(str(?subClassOf), 'http', 'i'))} \"\n",
    "\n",
    "    for rij in doGraph.query(query):\n",
    "        print(rij[0])\n",
    "        for i,r in workdata[workdata[\"mondo_uri\"]==str(rij[0])].iterrows():\n",
    "            statements.append(wdi_core.WDItemID(r[\"qid\"].replace(\"http://www.wikidata.org/entity/\", \"\"), prop_nr=\"P279\", references=[copy.deepcopy(mondo_reference)]))\n",
    "    \n",
    "    # exact matches\n",
    "    for skosExactMatch in list(set(row[\"exactMatches\"].split(\"|\"))):\n",
    "        if skosExactMatch != \"\":\n",
    "            statements.append(wdi_core.WDUrl(skosExactMatch, prop_nr=\"P2888\", references=[copy.deepcopy(mondo_reference)]))\n",
    "            # MeSH descriptor ID (P486)\n",
    "            # http://identifiers.org/mesh/\n",
    "            if \"http://identifiers.org/mesh/\" in skosExactMatch:\n",
    "                mesh = skosExactMatch.replace(\"http://identifiers.org/mesh/\", \"\")\n",
    "                statements.append(wdi_core.WDExternalID(mesh, prop_nr=\"P486\", references=[copy.deepcopy(mondo_reference)]))\n",
    "                # UMLS CUI (P2892)\n",
    "                # http://linkedlifedata.com/resource/umls/id/\n",
    "            if \"http://linkedlifedata.com/resource/umls/id/\" in skosExactMatch:\n",
    "                umls = skosExactMatch.replace(\"http://linkedlifedata.com/resource/umls/id/\", \"\")\n",
    "                statements.append(wdi_core.WDExternalID(umls, prop_nr=\"P2892\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "            # Orphanet ID (P1550)\n",
    "            # http://www.orpha.net/ORDO/Orphanet_\n",
    "            if \"http://www.orpha.net/ORDO/Orphanet_\" in skosExactMatch:\n",
    "                ordo = skosExactMatch.replace(\"http://www.orpha.net/ORDO/Orphanet_\", \"\")\n",
    "                statements.append(wdi_core.WDExternalID(ordo, prop_nr=\"P1550\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "            # SNOMED CT identifier (P5806)\n",
    "            # http://identifiers.org/snomedct/191347008\n",
    "            if \"http://identifiers.org/snomedct/\" in skosExactMatch:\n",
    "                snomed = skosExactMatch.replace(\"http://identifiers.org/snomedct/\", \"\")\n",
    "                statements.append(wdi_core.WDExternalID(snomed, prop_nr=\"P5806\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "            # NCI Thesaurus ID (P1748)\n",
    "            # http://purl.obolibrary.org/obo/NCIT_\n",
    "            if \"http://purl.obolibrary.org/obo/NCIT_\" in skosExactMatch:\n",
    "                ncit = skosExactMatch.replace(\"http://purl.obolibrary.org/obo/NCIT_\", \"NCIT:\")\n",
    "                statements.append(wdi_core.WDString(ncit, prop_nr=\"P1748\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "            # OMIM (P492)\n",
    "            # http://identifiers.org/omim/\n",
    "            if \"http://identifiers.org/omim/\" in skosExactMatch:\n",
    "                omim = skosExactMatch.replace(\"http://identifiers.org/omim/\", \"\")\n",
    "                statements.append(wdi_core.WDExternalID(omim, prop_nr=\"P492\", references=[copy.deepcopy(mondo_reference)]))\n",
    "\n",
    "\n",
    "\n",
    "    wb_mondo_item = wdi_core.WDItemEngine(wd_item_id=row[\"qid\"].replace(\"http://www.wikidata.org/entity/\",\"\"), data=statements, keep_good_ref_statements=True)\n",
    "\n",
    "    if wb_mondo_item.get_label() == \"\":\n",
    "        wb_mondo_item.set_label(row[\"label\"], lang=\"en\")\n",
    "    if wb_mondo_item.get_description() == \"\":\n",
    "        wb_mondo_item.set_description(\"human disease\", lang=\"en\")\n",
    "    if row[\"aliases\"] != \"\":\n",
    "        aliases = wb_mondo_item.get_aliases()\n",
    "        for new_alias in row[\"aliases\"].split(\"|\"):\n",
    "            aliases.append(new_alias)\n",
    "        wb_mondo_item.set_aliases(list(set(aliases)), lang=\"en\")\n",
    "\n",
    "    #pprint.pprint(wb_mondo_item.get_wd_json_representation())\n",
    "    return wb_mondo_item.write(login)\n",
    "\n",
    "for index, row in workdata.iterrows():\n",
    "    qid = row[\"qid\"].replace(\"http://www.wikidata.org/entity/\", \"\")\n",
    "    if qid != \"\":\n",
    "        item = wdi_core.WDItemEngine(wd_item_id=qid)\n",
    "        data = [wdi_core.WDBaseDataType.delete_statement(prop_nr=\"P5270\")]\n",
    "        item = wdi_core.WDItemEngine(wd_item_id=qid, data=data)\n",
    "        print(item.write(login))\n",
    "        remove_mondo_ref(qid)\n",
    "        print(updateMondo(row))\n",
    "        \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [],
   "source": [
    "def createMONDOReference(doid):\n",
    "    statedin = wdi_core.WDItemID(\"Q27468140\", prop_nr=\"P248\", is_reference=True)\n",
    "    retrieved = datetime.now()\n",
    "    timeStringNow = retrieved.strftime(\"+%Y-%m-%dT00:00:00Z\")\n",
    "    refRetrieved = wdi_core.WDTime(timeStringNow, prop_nr=\"P813\", is_reference=True)\n",
    "    doid = wdi_core.WDExternalID(doid, prop_nr=\"P5270\", is_reference=True)\n",
    "    return [statedin, refRetrieved, doid]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "pycharm": {
     "is_executing": true
    },
    "scrolled": false
   },
   "outputs": [],
   "source": [
    "wb_mondo_item = wdi_core.WDItemEngine(data=statements, keep_good_ref_statements=True,)\n",
    "\n",
    "aliases = \"proliferative vasculopathy and hydranencephaly/hydrocephaly|Encephaloclastic proliferative vasculopathy|hydrocephaly/hydranencephaly due to cerebral vasculopathy|cerebral proliferative glomeruloid vasculopathy|proliferative vasculopathy and hydranencephaly/hydrocephaly|Encephaloclastic proliferative vasculopathy|hydrocephaly/hydranencephaly due to cerebral vasculopathy|cerebral proliferative glomeruloid vasculopathy|proliferative vasculopathy and hydranencephaly/hydrocephaly|Encephaloclastic proliferative vasculopathy|hydrocephaly/hydranencephaly due to cerebral vasculopathy|cerebral proliferative glomeruloid vasculopathy|proliferative vasculopathy and hydranencephaly/hydrocephaly|Encephaloclastic proliferative vasculopathy|hydrocephaly/hydranencephaly due to cerebral vasculopathy|cerebral proliferative glomeruloid vasculopathy|proliferative vasculopathy and hydranencephaly/hydrocephaly|Encephaloclastic proliferative vasculopathy|hydrocephaly/hydranencephaly due to cerebral vasculopathy|cerebral proliferative glomeruloid vasculopathy|proliferative vasculopathy and hydranencephaly/hydrocephaly|Encephaloclastic proliferative vasculopathy|hydrocephaly/hydranencephaly due to cerebral vasculopathy|cerebral proliferative glomeruloid vasculopathy\"\n",
    "if wb_mondo_item.get_label() == \"\":\n",
    "    wb_mondo_item.set_label(row[\"label\"], lang=\"en\")\n",
    "if wb_mondo_item.get_description() == \"\":\n",
    "    wb_mondo_item.set_description(\"human disease\", lang=\"en\")\n",
    "if row[\"aliases\"] != \"\":\n",
    "    aliases = wb_mondo_item.get_aliases()\n",
    "    for new_alias in aliases.split(\"|\"):\n",
    "        aliases.append(new_alias)\n",
    "    wb_mondo_item.set_aliases(aliases, lang=\"en\")\n",
    "\n",
    "pprint.pprint(wb_mondo_item.get_wd_json_representation())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "pycharm": {
     "is_executing": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://purl.obolibrary.org/obo/MONDO_0000761\n",
      "Q16918398\n"
     ]
    }
   ],
   "source": [
    "query=\"\"\"PREFIX obo: <http://www.geneontology.org/formats/oboInOwl#>\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX oboInOwl: <http://www.geneontology.org/formats/oboInOwl#>\n",
    "\n",
    "        SELECT ?subClassOf WHERE {\"\"\"\n",
    "\n",
    "query+= \"<\"+row[\"mondo_uri\"]+\"> rdfs:subClassOf ?subClassOf .  FILTER (REGEX(str(?subClassOf), 'http', 'i'))} \"\n",
    "\n",
    "for rij in doGraph.query(query):\n",
    "    print(rij[0])\n",
    "    for i,r in workdata[workdata[\"mondo_uri\"]==str(rij[0])].iterrows():\n",
    "        print(r[\"qid\"].replace(\"http://www.wikidata.org/entity/\", \"\"))\n",
    "\n",
    "    \n",
    "#if row[0].replace(\"http://purl.obolibrary.org/obo/DOID_\", \"DOID:\") not in doQids.keys():\n",
    "#    doQids[row[0].replace(\"http://purl.obolibrary.org/obo/DOID_\", \"DOID:\")] = create(row[0].replace(\"http://purl.obolibrary.org/obo/DOID_\", \"DOID:\"))\n",
    "#    #statements.append(wdi_core.WDItemID(value=doQids[row[0].replace(\"http://purl.obolibrary.org/obo/DOID_\", \"DOID:\")].replace(\"http://www.wikidata.org/entity/\", \"\"),row[\"mondo_uri\"],prop_nr=\"P279\", references=[copy.deepcopy(do_reference)]))\n",
    "#query=\"\"\"PREFIX skos: <http://www.w3.org/2004/02/skos/core#>"
   ]
  }
 ],
 "metadata": {
  "colab": {
   "collapsed_sections": [],
   "name": "MONDOBot on Wikibase.ipynb",
   "provenance": []
  },
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}